#include "minishell.h"

void	ft_print_welcome(void)
{
	printf("%s\n", CYAN);
	printf("██╗  ██╗█╗██╗  █╗█╗████╗█╗█╗████╗█╗   █╗   \n");
	printf("███╗███║█║███╗ █║█║█╔══╝█║█║█╔══╝█║   █║   \n");
	printf("█╔███╔█║█║█╔██╗█║█║████╗███║████╗█║   █║   \n");
	printf("█║╚█╔╝█║█║█║╚███║█║╚══█║█╔█║█╔══╝█║   █║   \n");
	printf("█║ ╚╝ █║█║█║ ╚██║█║████║█║█║████╗████╗████╗\n");
	printf("╚╝    ╚╝╚╝╚╝  ╚═╝╚╝╚═══╝╚╝╚╝╚═══╝╚═══╝╚═══╝\n");
	printf("%s", YELLOW);
	printf("\n");
	printf("-------------------------------------------\n");
	printf("          %sWelcome to Minishell!          \n", GREEN);
	printf("           %sCtrl-\\  - Disabled            \n", BLUE);
	printf("           %sCtrl-C  - New Line            \n", BLUE);
	printf("           %sCtrl-D  - EXIT                \n", BLUE);
	printf("%s", YELLOW);
	printf("-------------------------------------------\n");
	printf("%s\n", RESET);
}

void	ft_print_exit(void)
{
	printf("\n");
	printf("%s\n", MAGENTA);
	printf("        █████╗ ██╗   ██╗██╗████████╗      \n");
	printf("        ██╔══╝ ╚██╗ ██╔╝██║   ██╔══╝      \n");
	printf("        █████╗  ╚████╔╝ ██║   ██║         \n");
	printf("        ██╔══╝  ██╔═██╗ ██║   ██║         \n");
	printf("        █████╗ ██╔╝ ╚██╗██║   ██║         \n");
	printf("        ╚════╝ ╚═╝   ╚═╝╚═╝   ╚═╝         \n");
	printf("%s", YELLOW);
	printf("\n");
	printf("-------------------------------------------\n");
	printf("            %sExiting Minishell!           \n", RED);
	printf("%s", YELLOW);
	printf("-------------------------------------------\n");
	printf("%s\n", RESET);
}
